``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_blockstorage_volume_v2.biohackathon-vol will be created
  + resource "openstack_blockstorage_volume_v2" "biohackathon-vol" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "Data volume for biohackathon VM"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = (known after apply)
      + region            = (known after apply)
      + size              = 1000
      + volume_type       = "default"
    }

  # openstack_compute_instance_v2.biohackathon will be created
  + resource "openstack_compute_instance_v2" "biohackathon" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c36m100d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "c6906a58-1e05-4be0-8f20-41f24c8320b5"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "biohackathon 2023 dedicated VM"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "c9f0cb4ee8e48cd2db8a3a7106f2d84689ec0b87"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.biohackathon-va will be created
  + resource "openstack_compute_volume_attach_v2" "biohackathon-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

  # random_id.biohackathon-volume_name_unique will be created
  + resource "random_id" "biohackathon-volume_name_unique" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```